hx_sweep/LN2_3bar_Re500_gON/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           volVectorField;
    location        "0";
    object          U;
}

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0.010115 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.010115 0 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0.010115 0 0);
    }
    heatedWall
    {
        type            noSlip;
    }
    adiabaticWalls
    {
        type            noSlip;
    }
}


// ************************************************************************* //
